<template>
	<div class="content mt40">
	    <div class="newsList">
	    	<ul>
	            <li>
	            	<a href="conText.html">
	                    <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	            <li>
	            	<a href="conText.html">
	                      <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	            <li>
	            	<a href="conText.html">
	                     <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	            <li>
	            	<a href="conText.html">
	                      <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	            <li>
	            	<a href="conText.html">
	                      <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	            <li>
	            	<a href="conText.html">
	                     <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	            <li>
	            	<a href="conText.html">
	                     <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	            <li>
	            	<a href="conText.html">
	                     <h2>这是关注的东西这是关注的东西这是关注的东西这是关注的东西这是关注的东西</h2>
	                    <p>还可以降低首付款健还可以降低首付款健身房还可以降低首付款健身房身房还可以降低首付款健还可以降低首付款健身房身房</p>
	                </a>
	            </li>
	        </ul>
	    </div>
	</div>
</template>
<script>
	export default {
	}
</script>
<style scoped>
	.mt40{
		margin-top:40px;
	}
</style>