<template>
    <div id='home'>
        <div class="content">
            <Slider></Slider>
            <div class="newsList">
                <ul>
                    <li>
                        <a href="conText.html">
                            <h2>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</h2>
                            <p>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</p>
                        </a>
                    </li>
                    <li>
                        <a href="conText.html">
                            <h2>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</h2>
                            <p>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</p>
                        </a>
                    </li> <li>
                    <a href="conText.html">
                        <h2>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</h2>
                        <p>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</p>
                    </a>
                </li> <li>
                    <a href="conText.html">
                        <h2>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</h2>
                        <p>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</p>
                    </a>
                </li> <li>
                    <a href="conText.html">
                        <h2>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</h2>
                        <p>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</p>
                    </a>
                </li> <li>
                    <a href="conText.html">
                        <h2>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</h2>
                        <p>还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款还可以降低首付款</p>
                    </a>
                </li>
                </ul>
            </div>
        </div>
    </div>
 </div>

</template>

<script>
import Slider from './Slider.vue'
	export default {
		data(){
			return {
				arrList:[]
			}
		},
		components:{
			Slider
		},
        mounted(){
		    //默认执行方法
            this.getData();

        },
		methods:{
			//获取数据
            getData(){
                this.$jsonp('https://api.douban.com/v2/book/1220562',null, function (err, data) {
                    if (err) {
                        console.error(err.message);
                    } else {
                        console.log(data);
                    }
                });

                this.$http.get("src/data/follow.data").then(function (res) {
                    console.log(res);
                }).catch(function (err) {
                    console.log('首页请求失败',err)
                })
            }

		}
	}

</script>